tutorials/reactiveTransport/MAT/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
|    \\/     M anipulation  |                                                 |
\i*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../caseSetup"

convertToMeters 1;


/*
    
   7___________  6        
   /__________/|
 4| |       5| | 
  | |        | |
  | |        | |
  | |        | |  
  | |_3______|_| 2
  |/_________|/
 0           1 

*/

vertices
(
    (-4 -2 -0.1)  // 0
    (4 -2 -0.1)  // 1
    (4 2 -0.1)  // 2
    (-4 2 -0.1)  // 3
    (-4 -2 0.1)  // 4
    (4 -2 0.1)  // 5
    (4 2 0.1)  // 6
    (-4 2 0.1)  // 7
);


blocks
(
    hex (0 1 2 3 4 5 6 7 ) (160 80 1) simpleGrading (1 1 1)
);


edges
(
);


boundary
(

    top
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
        );
    }
    
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5) 
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3) 
        );
    }
/*   
    frontBack
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)  

        );
    }*/
);

mergePatchPairs
(
);


// ************************************************************************* //
