tutorials/reactiveTransport/MAT/constant/reactionDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactionDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//              k*prod(C_i^exponents_i)
// r = ------------------------------------------------
//     {1+sum[(Ks_i*C_i)^exponentsS_i]}^exponentsS_total

//k [ 0 -3(1-n) -1 0 (1-n) 0 0] 

zoneName    catalyst;   // Name of the cellsZone where the reaction occurs. You can e "all" to consider all cells

reactions
(
    M1source
    {
        // Reaction coefficients
        k             k [0 -3 -1 0 1 0 0] 1;
        species       (M1);
        stoichiometry (1);
        exponents     (0);
        kS            (0);
        exponentsS    (0);
        exponentsS_total 0;

        zoneName    all;
    }

    M2source
    {
        // Reaction coefficients
        k             k [0 0 -1 0 0 0 0] 2;
        species       (M1 M2);
        stoichiometry (0 1);
        exponents     (1 0);
        kS            (0 0);
        exponentsS    (0 0);
        exponentsS_total 0;

        zoneName    all;
    }

    M1inSolid_source
    {
        // Reaction coefficients
        k             k [0 -3 -1 0 1 0 0] 1;
        species       (M1inSolid);
        stoichiometry (1);
        exponents     (0);
        kS            (0);
        exponentsS    (0);
        exponentsS_total 0;

        zoneName    catalyst;
    }

);