tutorials/reactiveTransport/MAT/constant/speciesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      speciesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
species
(
    M1
    {
        D          D [0 2 -1 0 0 0 0] 1e-2;
        Ds         Ds [0 2 -1 0 0 0 0]1e-3;
    }

    M2
    {
        D          D [0 2 -1 0 0 0 0] 1e-2;
        Ds         Ds [0 2 -1 0 0 0 0]1e-3;
    }

    M1inSolid
    {
        D          D [0 2 -1 0 0 0 0] 1e-2;
        Ds         Ds [0 2 -1 0 0 0 0]1e-3;
    }
);