tutorials/reactiveTransport/MAT/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../caseSetup"

actions
(
	{
		name catalyst;
		type cellZoneSet;
		action new;
		source boxToCell;
		sourceInfo
    	{
      		box (-0.5 -1.25 -0.75) (0.5 1.25 0.075);
    	}
	}
);
// ************************************************************************* //   
